app/controllers/users_controller.rb

  def create
    @user = User.new(white_list_user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "asd"], ["email", "w"], ["password", "sw"], ["created_at", 2017-04-17 15:43:08 UTC], ["updated_at", 2017-04-17 15:43:08 UTC]]